app/controllers/api/edu_api_controller.rb

  def index
    educations = Education.all
---
SELECT "educations".* FROM "educations"

  def create
    education = Education.new(
      institution_name: params[:institution_name],
      start_month: params[:start_month],
      start_year: params[:start_year],
      end_month: params[:end_month],
      end_year: params[:end_year],
      degree: params[:degree],
      field: params[:field]
    )

    education.save
---
INSERT INTO "educations" ("institution_name", "start_month", "start_year", "end_month", "end_year", "degree", "field", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"