app/controllers/api/work_api_controller.rb

  def create
    work_experience = Work.new(
      title: params[:title],
      company_name: params[:company_name],
      start_month: params[:start_month],
      start_year: params[:start_year],
      end_month: params[:end_month],
      end_year: params[:end_year],
      industry: params[:industry],
      description: params[:description]
    )

    work_experience.save
---
INSERT INTO "work_experiences" ("title", "company_name", "start_month", "start_year", "end_month", "end_year", "industry", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"